mKoDba/nrf51_muha/application/bsp/bsp_ecg_ADS1192.c
/*******************************************************************************
 *                          PUBLIC FUNCTION DEFINITIONS
 ******************************************************************************/
/*******************************************************************************
 * @brief Function initializes ECG ADS1192 component.
 ******************************************************************************
 * @param [in]  *inDevice - device structure for ECG driver
 * @param [in]  *inConfig - configuration structure for ECG driver.
 * @param [out] *outErr   - error parameter.
 ******************************************************************************
 * @author  mario.kodba
 * @date    21.10.2020
 ******************************************************************************/
void BSP_ECG_ADS1192_init(BSP_ECG_ADS1192_device_S *inDevice,
                          BSP_ECG_ADS1192_config_S *inConfig,
                          BSP_ECG_ADS1192_err_E *outErr) {

    BSP_ECG_ADS1192_err_E ecgErr = BSP_ECG_ADS1192_err_NONE;

    if((inDevice != NULL) && (inConfig != NULL)) {
        inDevice->config = inConfig;
        inDevice->isInitialized = false;

        // internal oscillator start-up time
        nrf_delay_us(BSP_ECG_ADS1192_INIT_WAIT_TIME_32_US);

        // send reset impulse
        BSP_ECG_ADS1192_initReset(inDevice, &ecgErr);

        /* on power-up device defaults to Read Data Continous mode,
         * stop it to enable sending SPI commands */
        BSP_ECG_ADS1192_sendSpiCommand(inDevice, BSP_ECG_ADS1192_SPI_SDATAC, &ecgErr);
        // wait 4 * tCLK after sending SDATAC command
        nrf_delay_us(BSP_ECG_ADS1192_INIT_WAIT_TIME_8_US);

        // set internal reference voltage (2.42V)
        BSP_ECG_ADS1192_config2Reg_U conf2Reg = { .R = 0x80u };
        conf2Reg.B.pdbRefBuf = 1u;
        BSP_ECG_ADS1192_writeReg(inDevice,
                                 BSP_ECG_ADS1192_reg_CONFIG_2,
                                 1u,
                                 (uint8_t *) &conf2Reg,
                                 1u,
                                 &ecgErr);
        // wait for reference voltage to settle
        nrf_delay_us(BSP_ECG_ADS1192_INIT_WAIT_TIME_200_MS);

        // set 500SPS, continuous conversion
        if(ecgErr == BSP_ECG_ADS1192_err_NONE) {
            BSP_ECG_ADS1192_config1Reg_U conf1Reg = { .R = 0u };
            conf1Reg.B.dr1 = 1u;
            BSP_ECG_ADS1192_writeReg(inDevice,
                                     BSP_ECG_ADS1192_reg_CONFIG_1,
                                     1u,
                                     (uint8_t *) &conf1Reg,
                                     1u,
                                     &ecgErr);
        }

        BSP_ECG_ADS1192_updateTemperature(inDevice, &ecgErr);

        BSP_ECG_ADS1192_readTestSignal(inDevice, &ecgErr);

        // set both channels to input short (offset measurements)
        if(ecgErr == BSP_ECG_ADS1192_err_NONE) {
            uint8_t chRegs[2] = { 1u, 1u };
            BSP_ECG_ADS1192_writeReg(inDevice,
                                     BSP_ECG_ADS1192_reg_CH1_SET,
                                     2u,
                                     (uint8_t *) &chRegs,
                                     2u,
                                     &ecgErr);
        }

        uint32_t drdy = nrf_gpio_pin_read(ECG_DRDY);
        uint8_t outBuffer[16] = { 0u };
        // START pin is set to 1 already (pulled to VCC)
        // begin reading data from device
        BSP_ECG_ADS1192_sendSpiCommand(inDevice, BSP_ECG_ADS1192_SPI_RDATAC, &ecgErr);
        // nDRDY should be 0 now
        drdy = nrf_gpio_pin_read(ECG_DRDY);
        // read data shifted out from device
        // 16 status bits + 2 channels x 16 bits
        BSP_ECG_ADS1192_readData(inDevice, 16, &outBuffer[0], &ecgErr);
        for(uint8_t i = 0u; i<16; i++) {
            SEGGER_RTT_printf(0, "%x\n", outBuffer[i]);
        }
        drdy = nrf_gpio_pin_read(ECG_DRDY);
        // stop reading data
        BSP_ECG_ADS1192_sendSpiCommand(inDevice, BSP_ECG_ADS1192_SPI_SDATAC, &ecgErr);

        // now do test signal
        if(ecgErr == BSP_ECG_ADS1192_err_NONE) {
            BSP_ECG_ADS1192_config2Reg_U conf2Reg = { .R = 0u };
            conf2Reg.R = 0xA3u;
            BSP_ECG_ADS1192_writeReg(inDevice,
                                     BSP_ECG_ADS1192_reg_CONFIG_2,
                                     1u,
                                     (uint8_t *) &conf2Reg,
                                     1u,
                                     &ecgErr);
        }
        // set both channels to test signal
        if(ecgErr == BSP_ECG_ADS1192_err_NONE) {
            uint8_t chRegs[2] = { 5u, 5u };
            BSP_ECG_ADS1192_writeReg(inDevice,
                                     BSP_ECG_ADS1192_reg_CH1_SET,
                                     2u,
                                     &chRegs[0],
                                     2u,
                                     &ecgErr);
        }
        uint8_t outBuffer2[18] = { 0u };
        BSP_ECG_ADS1192_sendSpiCommand(inDevice, BSP_ECG_ADS1192_SPI_RDATAC, &ecgErr);
        SEGGER_RTT_printf(0, "--------------\n");
        BSP_ECG_ADS1192_readData(inDevice, 18, &outBuffer2[0], &ecgErr);
        for(uint8_t i = 0u; i<18; i++) {
            SEGGER_RTT_printf(0, "%x\n", outBuffer2[i]);
        }
        BSP_ECG_ADS1192_sendSpiCommand(inDevice, BSP_ECG_ADS1192_SPI_SDATAC, &ecgErr);

        if(ecgErr == BSP_ECG_ADS1192_err_NONE) {
            inDevice->isInitialized = true;
        }
    } else {
        ecgErr = BSP_ECG_ADS1192_err_NULL_PARAM;
    }

    if(outErr != NULL) {
        *outErr = ecgErr;
    }
}

/*******************************************************************************
 *                         PRIVATE FUNCTION DEFINITIONS
 ******************************************************************************/
/*******************************************************************************
 * @brief Function sends predefined SPI command to the device.
 ******************************************************************************
 * @param [in]  *inDevice - device structure for ECG driver.
 * @param [in]  inSpiCmd  - SPI command.
 * @param [out] *outErr   - error parameter.
 ******************************************************************************
 * @author  mario.kodba
 * @date    24.10.2020
 ******************************************************************************/
static void BSP_ECG_ADS1192_sendSpiCommand(BSP_ECG_ADS1192_device_S *inDevice,
                                           const uint8_t inSpiCmd,
                                           BSP_ECG_ADS1192_err_E *outErr) {

    BSP_ECG_ADS1192_err_E ecgErr = BSP_ECG_ADS1192_err_NONE;

    if(inDevice == NULL) {
        ecgErr = BSP_ECG_ADS1192_err_NULL_PARAM;
    } else {
        uint32_t ret_code;
        ret_code = nrf_drv_spi_transfer(inDevice->config->spiInstance,
                                        &inSpiCmd,
                                        1u,
                                        NULL,
                                        0u);
        if(ret_code != NRF_SUCCESS) {
            ecgErr = BSP_ECG_ADS1192_err_SPI_READ_WRITE;
        }
    }

    if(outErr != NULL) {
        *outErr = ecgErr;
    }
}

