mKoDba/nrf51_muha/application/bsp/bsp_ecg_ADS1192.c
/*******************************************************************************
 * @brief Function for writing to on or multiple registers of ADS1192.
 ******************************************************************************
 * @param [in]  *inDevice    - device structure for ECG driver.
 * @param [in]  inStartReg   - starting register address.
 * @param [in]  inRegNumber  - number of registers to be written to.
 * @param [in]  *inData      - pointer to data to be sent.
 * @param [in]  inDataLength - number of data bytes to send.
 * @param [out] *outErr      - error parameter.
 ******************************************************************************
 * @author  mario.kodba
 * @date    21.10.2020
 ******************************************************************************/
static void BSP_ECG_ADS1192_writeReg(BSP_ECG_ADS1192_device_S *inDevice,
                                     const BSP_ECG_ADS1192_reg_E inStartReg,
                                     const uint8_t inRegNumber,
                                     const uint8_t *inData,
                                     const uint8_t inDataLength,
                                     BSP_ECG_ADS1192_err_E *outErr) {

    BSP_ECG_ADS1192_err_E ecgErr = BSP_ECG_ADS1192_err_NONE;

    uint8_t opcode[BSP_ECG_ADS1192_SPI_OPCODE_SIZE] = { 0u };
    uint8_t regAddr = ecgADS1192RegAddr[inStartReg];
    uint32_t ret_code;

    if((inDevice != NULL) && (inData != NULL)) {
        // format for write opcode: | 010r rrrr | 000n nnnn |
        // set first byte of opcode for write operation
        opcode[0] = (BSP_ECG_ADS1192_SPI_WRITE_OP | regAddr);
        // second byte represents number of registers we write to - 1
        opcode[1] = inRegNumber - 1u;

        uint8_t spiMsg[BSP_ECG_ADS1192_SPI_MSG_MAX_SIZE] = { 0u };
        // 2 bytes for opcode + input data length
        uint8_t msgSize = inDataLength + BSP_ECG_ADS1192_SPI_OPCODE_SIZE;

        // assemble SPI message
        // OPCODE_1 | OPCODE_2 | DATA1 | DATA2 | DATA3 | ...
        spiMsg[0] = opcode[0];
        spiMsg[1] = opcode[1];
        (void *) memcpy((uint8_t *) &(spiMsg[2]), inData, inDataLength);
        // leave RX buffer empty, function allows it
        ret_code = nrf_drv_spi_transfer(&spi0Instance, spiMsg, msgSize, NULL, 0u);

        if(ret_code != NRF_SUCCESS) {
            ecgErr = BSP_ECG_ADS1192_err_SPI_READ_WRITE;
        }
    } else {
        ecgErr = BSP_ECG_ADS1192_err_NULL_PARAM;
    }

    if(outErr != NULL) {
        *outErr = ecgErr;
    }
}

/*******************************************************************************
 * @brief Function for reading from one or multiple registers of ADS1192.
 ******************************************************************************
 * @param [in]  *inDevice    - device structure for ECG driver.
 * @param [in]  inStartReg   - starting register address.
 * @param [in]  inRegNumber  - number of registers to read.
 * @param [out] *outData     - pointer to data to be read.
 * @param [out] *outErr      - error parameter.
 ******************************************************************************
 * @author  mario.kodba
 * @date    21.10.2020
 ******************************************************************************/
static void BSP_ECG_ADS1192_readReg(BSP_ECG_ADS1192_device_S *inDevice,
                                    const BSP_ECG_ADS1192_reg_E inStartReg,
                                    const uint8_t inRegNumber,
                                    uint8_t *outData,
                                    BSP_ECG_ADS1192_err_E *outErr) {

    BSP_ECG_ADS1192_err_E ecgErr = BSP_ECG_ADS1192_err_NONE;

    uint8_t opcode[BSP_ECG_ADS1192_SPI_OPCODE_SIZE] = { 0u };
    uint8_t regAddr = ecgADS1192RegAddr[inStartReg];

    if((inDevice != NULL) && (outData != NULL)) {
        // format for read opcode: | 001r rrr | 000n nnnn |
        // set first byte of opcode for read operation
        opcode[0] = (BSP_ECG_ADS1192_SPI_READ_OP << 5u) | regAddr;
        // set second byte of opcode to inRegNumber - 1
        opcode[1] = inRegNumber - 1;

        uint32_t ret_code;
        // start SPI transfer
        // TODO: check this
        // first 2 bytes from RX should be discarded?
        ret_code = nrf_drv_spi_transfer(&spi0Instance,
                                        opcode,
                                        BSP_ECG_ADS1192_SPI_OPCODE_SIZE,
                                        &outData[0],
                                        inRegNumber+2u);
        if(ret_code != NRF_SUCCESS) {
            ecgErr = BSP_ECG_ADS1192_err_SPI_READ_WRITE;
        }
    } else {
        ecgErr = BSP_ECG_ADS1192_err_NULL_PARAM;
    }

    if(outErr != NULL) {
        *outErr = ecgErr;
    }
}

/*******************************************************************************
 * @brief Function for reading data shifted out of ADS1192.
 ******************************************************************************
 * @param [in]  *inDevice    - device structure for ECG driver.
 * @param [in]  inSize       - length (in bytes) of data to be read.
 * @param [out] *outData     - pointer to data to be read.
 * @param [out] *outErr      - error parameter.
 ******************************************************************************
 * @author  mario.kodba
 * @date    01.11.2020
 ******************************************************************************/
static void BSP_ECG_ADS1192_readData(BSP_ECG_ADS1192_device_S *inDevice,
                                    const uint8_t inSize,
                                    uint8_t *outData,
                                    BSP_ECG_ADS1192_err_E *outErr) {

    BSP_ECG_ADS1192_err_E ecgErr = BSP_ECG_ADS1192_err_NONE;

    if((inDevice != NULL) && (outData != NULL)) {
        uint32_t ret_code;
        // start SPI transfer
        ret_code = nrf_drv_spi_transfer(&spi0Instance,
                                        NULL,
                                        0u,
                                        &outData[0],
                                        inSize);
        if(ret_code != NRF_SUCCESS) {
            ecgErr = BSP_ECG_ADS1192_err_SPI_READ_WRITE;
        }
    } else {
        ecgErr = BSP_ECG_ADS1192_err_NULL_PARAM;
    }

    if(outErr != NULL) {
        *outErr = ecgErr;
    }
}

